window.GLOSSARY = {
  dynamic_lines: {
    term: "Δυναμικές γραμμές",
    def:  `Υποθετικές γραμμές που δίνουν την εικόνα ενός πεδίου στο χώρο.`
  },
  intermittent_energy: {
    term: "διαλείπουσα ενέργεια",
    def:  `Η διαλείπουσα ενέργεια (intermittent energy) είναι όρος που χρησιμοποιείται κυρίως στον τομέα της ενέργειας και των ανανεώσιμων πηγών (ΑΠΕ), και αναφέρεται σε μορφές ενέργειας που δεν παράγονται συνεχώς ή σταθερά, αλλά επαναλαμβάνονται με διακοπές, εξαρτώμενες από εξωτερικούς παράγοντες όπως ο καιρός, η ώρα της ημέρας ή φυσικά φαινόμενα.`
  },
  energy_perservation: {
    term: "Αρχή διατήρησης της ενέργειας (ΑΔΕ)",
    def:  `Η Αρχή Διατήρησης της Ενέργειας (ή Νόμος Διατήρησης της Ενέργειας) είναι μία από τις πιο θεμελιώδεις αρχές της Φυσικής. Σύμφωνα με αυτήν:
Η ενέργεια δεν μπορεί ούτε να δημιουργηθεί από το μηδέν, ούτε να καταστραφεί. Μπορεί μόνο να μετατραπεί από τη μία μορφή στην άλλη ή να μεταφερθεί από ένα σώμα/σύστημα σε άλλο.`
  },
rare_elements: {
    term: "Σπάνιες γαίες",
    def:  `Οι σπάνιες γαίες (Rare Earth Elements – REE) είναι μια ομάδα 17 χημικών στοιχείων στον περιοδικό πίνακα, τα οποία παίζουν κρίσιμο ρόλο στην υψηλή τεχνολογία, την πράσινη ενέργεια και την άμυνα. Το όνομα «σπάνιες γαίες» προέρχεται από την αρχική ανακάλυψή τους, όπου τα οξείδιά τους είχαν γαιώδη μορφή και θεωρούνταν σπάνια – στην πραγματικότητα δεν είναι καθόλου σπάνιες στον φλοιό της Γης (π.χ. το κέριο είναι πιο άφθονο από τον χαλκό), αλλά βρίσκονται σε χαμηλές συγκεντρώσεις και είναι δύσκολο/ακριβό να εξορυχθούν και να καθαριστούν.`
  },
natura: {
    term: "Περιοχές NATURA",
    def:  `Οι περιοχές NATURA (ή ακριβέστερα δίκτυο NATURA 2000) είναι το μεγαλύτερο συντονισμένο δίκτυο προστατευόμενων περιοχών στον κόσμο και αποτελεί βασικό εργαλείο της Ευρωπαϊκής Ένωσης για τη διατήρηση της βιοποικιλότητας.
Στην Ελλάδα, το δίκτυο NATURA 2000 καλύπτει σημαντικό μέρος της χώρας και είναι ιδιαίτερα εκτεταμένο λόγω της πλούσιας βιοποικιλότητας, των ενδιαιτημάτων και των ειδών (π.χ. θαλάσσια χελώνες, φώκιες, αρπακτικά πουλιά, σπάνια φυτά).`
  },
offshoreparks: {
    term: "Υπεράκτια αιολικά πάρκα",
    def:  `Τα υπεράκτια αιολικά πάρκα (offshore wind farms) είναι αιολικά πάρκα που εγκαθίστανται στη θάλασσα, συνήθως σε απόσταση από την ακτή (πέρα από τα 6 ναυτικά μίλια σε πολλές χώρες). Αποτελούν μία από τις πιο δυναμικές και υψηλής απόδοσης μορφές ανανεώσιμης ενέργειας, ιδιαίτερα σε χώρες με μεγάλη ακτογραμμή και ισχυρούς ανέμους.`
  },
 thermogas: {
    term: "Αέρια θερμοκηπίου",
    def:  `Τα αέρια του θερμοκηπίου (Greenhouse Gases – GHGs) είναι αέρια στην ατμόσφαιρα της Γης που απορροφούν και εκπέμπουν υπέρυθρη ακτινοβολία, προκαλώντας το φαινόμενο του θερμοκηπίου. Αυτό το φαινόμενο κρατάει τη Γη ζεστή (μέση θερμοκρασία ~15 °C αντί για -18 °C χωρίς αυτά), αλλά η υπερβολική αύξησή τους από ανθρώπινες δραστηριότητες ενισχύει την κλιματική αλλαγή και την υπερθέρμανση του πλανήτη.`
 },
  thermal_motor: {
    term: "Θερμικός κινητήρας",
    def:  `Ο θερμικός κινητήρας (ή θερμική μηχανή) είναι μια διάταξη που μετατρέπει θερμική ενέργεια (θερμότητα) σε μηχανικό έργο (κίνηση, ισχύ). Βασίζεται στην εκμετάλλευση της ροής θερμότητας από μια περιοχή υψηλής θερμοκρασίας (θερμή δεξαμενή) προς μια περιοχή χαμηλής θερμοκρασίας (ψυχρή δεξαμενή), σύμφωνα με τον δεύτερο θερμοδυναμικό νόμο.`
  },
friction: {
    term: "Τριβή",
    def:  `Η τριβή είναι μια δύναμη αντίστασης που αναπτύσσεται μεταξύ δύο επιφανειών που έρχονται σε επαφή και τείνουν να έχουν σχετική κίνηση (ή ήδη έχουν). Αντιστέκεται στην έναρξη ή στη συνέχιση της κίνησης. Η τριβή στους κινητήρες και τις γεννήτριες μετατρέπει μέρος της παρεχόμενης ενέργειας σε θερμότητα.`
  },
  left_threefinger_rule: {
    term: "Κανόνας των τριών δακτύλων για κινητήρα",
    def:  `Στην περίπτωση του ηλεκτρικού κινητήρα, για να προσδιορίσουμε την κατεύθυνση της δύναμης Laplace, εφαρμόζουμε την παρακάτω αντιστοίχιση δακτύλων στο αριστερό μας χέρι:
• Αντίχειρας → δείχνει τη φορά της δύναμης FL (ή της κίνησης/ροπή που προκύπτει)
• Δείκτης → δείχνει τη φορά του μαγνητικού πεδίου B (από Βόρειο προς Νότιο)
• Μέσο → δείχνει τη φορά της έντασης ρεύματος I. Τα τρία δάκτυλά είναι κάθετα μεταξύ τους.`
  },
  right_threefinger_rule: {
    term: "Κανόνας των τριών δακτύλων για αγωγό/γεννήτρια",
    def:  `Στην περίπτωση που θέλουμε να προσδιορίσουμε την κατεύθυνση της δύναμης Laplace σε αγωγό που ολισθαίνει μέσα σε μαγνητικό πεδίο, εφαρμόζουμε την παρακάτω αντιστοίχιση δακτύλων στο δεξί μας χέρι:
• Αντίχειρας → δύναμη FL,
• Δείκτης → ταχύτητα v ή ρεύμα I,
• Μέσο → μαγνητικό πεδίο B.
Τα τρία δάκτυλά είναι κάθετα μεταξύ τους.`
  },
  magnetic_field: {
    term: "Μαγνητικό πεδίο",
    def:  `Περιοχή του χώρου όπου ασκούνται μαγνητικές δυνάμεις.`
  },
  magnet: {
    term: "Mαγνήτης",
    def:  `Περιοχή του χώρου όπου ασκούνται μαγνητικές δυνάμεις.`
  },
  magnetic_density: {
    term: "Ένταση Μαγνητικού πεδίου Β",
    def:  `Η ένταση Β μαγνητικού πεδίου είναι ένα θεμελιώδες διανυσματικό μέγεθος στη φυσική που περιγράφει την ισχύ και την κατεύθυνση ενός μαγνητικού πεδίου. Ουσιαστικά, μας λέει πόσο ισχυρό είναι το μαγνητικό πεδίο σε ένα συγκεκριμένο σημείο και προς ποια κατεύθυνση ασκεί τη δύναμή του σε κινούμενα φορτία. Η ένταση Β μαγνητικού πεδίου ορίζεται ως η μαγνητική δύναμη που ασκείται ανά μονάδα μήκους σε αγωγό που διαρρέεται από μονάδα ρεύματος και είναι κάθετος στις γραμμές του μαγνητικού πεδίου. Μπορεί επίσης να οριστεί μέσω της δύναμης Lorentz που ασκείται σε κινούμενα ηλεκτρικά φορτία. Η μονάδα μέτρησης της έντασης Β στο Διεθνές Σύστημα Μονάδων (SI) είναι το Τέσλα (Tesla, T). Ένα Τέσλα ορίζεται ως ένα Νιούτον ανά Αμπέρ επί μέτρο (N/(A·m)). Μια παλαιότερη μονάδα, που εξακολουθεί να χρησιμοποιείται σε ορισμένους τομείς, είναι το Γκάους (Gauss, G), όπου 1 T = 10.000 G.`
  },
  electric_field: {
    term: "Ηλεκτρικό πεδίο",
    def:  `Το ηλεκτρικό πεδίο είναι η περιοχή του χώρου γύρω από ένα ηλεκτρικό φορτίο, μέσα στην οποία ασκείται ηλεκτρική δύναμη σε άλλα φορτισμένα σώματα.`
  },  
  horse_magnet: {
    term: "Πεταλοειδής μαγνήτης",
    def:  `Είναι ο μαγνήτης σε σχήμα πετάλου (U-shape), δηλαδή με τα δύο πόλους (βόρειο και νότιο) κοντά ο ένας στον άλλο. Χρησιμοποιείται συχνά σε εκπαιδευτικά πειράματα, σχολικά εργαστήρια και παιχνίδια μαγνητισμού, επειδή το μαγνητικό πεδίο είναι ισχυρότερο μεταξύ των δύο άκρων.`
  },
  electric_circuit: {
    term: "Ηλεκτρικό κύκλωμα",
    def:  `Ηλεκτρικό κύκλωμα είναι ένα σύνολο συνδεδεμένων εξαρτημάτων (όπως πηγή τάσης, αγωγοί, αντιστάσεις, λαμπτήρες κ.ά.) που επιτρέπει στα ηλεκτρόνια να κινούνται κυκλικά, δημιουργώντας ηλεκτρικό ρεύμα.`
  },

  // --- ΝΕΟΙ ΟΡΟΙ ---

  magnetic_force: {
    term: "Μαγνητική δύναμη",
    def:  `Η δύναμη που ασκείται από ένα μαγνητικό πεδίο σε μαγνήτες ή σε κινούμενα ηλεκτρικά φορτία (π.χ. σε ρεύμα μέσα σε αγωγό).`
  },
  geomagnetic_field: {
    term: "Γεωμαγνητικό πεδίο",
    def:  `Το μαγνητικό πεδίο της Γης, που προσανατολίζει την πυξίδα και δημιουργείται κυρίως από κινήσεις αγώγιμων υλικών στο εσωτερικό της.`
  },
  oersted: {
    term: "Oersted",
    def:  `Ο Hans Christian Ørsted, ο επιστήμονας που έδειξε ότι ένα ηλεκτρικό ρεύμα δημιουργεί μαγνητικό πεδίο, συνδέοντας έτσι τον ηλεκτρισμό με τον μαγνητισμό (ηλεκτρομαγνητικό φαινόμενο).`
  },
  electric_current: {
    term: "Ηλεκτρικό ρεύμα",
    def:  `Η προσανατολισμένη κίνηση ηλεκτρικών φορτίων (συνήθως ηλεκτρονίων) μέσα σε έναν αγωγό. Μετριέται σε αμπέρ (A).`
  },
  conductor: {
    term: "Αγωγός",
    def:  `Υλικό που επιτρέπει εύκολα τη διέλευση ηλεκτρικών φορτίων, άρα και τη δημιουργία ηλεκτρικού ρεύματος (π.χ. μέταλλα όπως ο χαλκός).`
  },
  electric_charge: {
    term: "Ηλεκτρικό φορτίο Q",
    def:  `Θεμελιώδης ιδιότητα της ύλης που προκαλεί ηλεκτρικές δυνάμεις. Υπάρχει θετικό και αρνητικό φορτίο και μετριέται σε κουλόμπ (C).`
  },
  electromagnetism: {
    term: "Ηλεκτρομαγνητισμός",
    def:  `Ο κλάδος της φυσικής που μελετά τη σχέση ανάμεσα στον ηλεκτρισμό και τον μαγνητισμό: πώς τα ηλεκτρικά φορτία και τα ρεύματα δημιουργούν πεδία και δυνάμεις.`
  },
  electromagnetic_phenomenon: {
    term: "Ηλεκτρομαγνητικό φαινόμενο",
    def:  `Το φαινόμενο κατά το οποίο το ηλεκτρικό ρεύμα δημιουργεί μαγνητικό πεδίο γύρω από τον αγωγό (π.χ. όταν κλείνει ένα κύκλωμα και περνά ρεύμα).`
  },
  coil: {
    term: "Σωληνοειδές ή Πηνίο",
    def:  `Σύρμα τυλιγμένο σε πολλές σπείρες. Όταν διαρρέεται από ρεύμα, δημιουργεί μαγνητικό πεδίο που μοιάζει με του μαγνήτη.`
  },
  electromagnet: {
    term: "Ηλεκτρομαγνήτης",
    def:  `Μαγνήτης που δημιουργείται όταν περνά ηλεκτρικό ρεύμα από πηνίο (συχνά γύρω από σιδερένιο πυρήνα). Μαγνητίζει όσο υπάρχει ρεύμα.`
  },
  electric_source: {
    term: "Ηλεκτρική πηγή",
    def:  `Συσκευή που παρέχει ενέργεια στο κύκλωμα και δημιουργεί διαφορά δυναμικού ώστε να κινηθούν τα φορτία (π.χ. μπαταρία, γεννήτρια).`
  },
  galvanometer: {
    term: "Γαλβανόμετρο",
    def:  `Όργανο που ανιχνεύει πολύ μικρά ηλεκτρικά ρεύματα και συχνά δείχνει και την κατεύθυνσή τους (π.χ. στην ηλεκτρομαγνητική επαγωγή).`
  },
  electromagnetic_induction: {
    term: "Ηλεκτρομαγνητική επαγωγή",
    def:  `Η δημιουργία τάσης (και άρα ρεύματος) σε ένα κύκλωμα όταν μεταβάλλεται το μαγνητικό πεδίο που το διαπερνά ή όταν μεταβάλλεται η μαγνητική ροή.`
  },
  induced_current: {
    term: "Επαγόμενο ρεύμα",
    def:  `Το ηλεκτρικό ρεύμα που εμφανίζεται σε ένα κύκλωμα λόγω ηλεκτρομαγνητικής επαγωγής, όταν αλλάζει η μαγνητική ροή που το διαπερνά.`
  },
  laplace_force: {
    term: "Δύναμη Laplace FL",
    def:  `Η δύναμη που δέχεται ένας αγωγός με ηλεκτρικό ρεύμα όταν βρίσκεται μέσα σε μαγνητικό πεδίο. Η κατεύθυνσή της εξαρτάται από τη φορά του ρεύματος και του πεδίου.`
  },
  interaction: {
    term: "Αλληλεπίδραση",
    def:  `Η αμοιβαία επίδραση δύο σωμάτων ή συστημάτων, όπου το καθένα ασκεί δύναμη στο άλλο (π.χ. μαγνήτης και αγωγός με ρεύμα).`
  },
  lorentz_force: {
    term: "Δύναμη Lorentz Fl",
    def:  `Η δύναμη που ασκείται σε ένα ηλεκτρικό φορτίο όταν κινείται μέσα σε ηλεκτρικό και/ή μαγνητικό πεδίο. Είναι η βασική δύναμη πίσω από πολλά ηλεκτρομαγνητικά φαινόμενα.`
  },
  net_force: {
    term: "Συνισταμένη δυνάμεων ΣF",
    def:  `Η μία δύναμη που ισοδυναμεί με όλες τις δυνάμεις που ασκούνται σε ένα σώμα μαζί (το διανυσματικό τους άθροισμα).`
  },
  force: {
    term: "Δύναμη F",
    def:  `Αιτία που μπορεί να μεταβάλει την κίνηση ενός σώματος ή να το παραμορφώσει. Μετριέται σε νιούτον (N).`
  },
  chemical_energy: {
    term: "Χημική ενέργεια",
    def:  `Ενέργεια αποθηκευμένη στους χημικούς δεσμούς των ουσιών. Σε μια μπαταρία, η χημική ενέργεια μετατρέπεται σε ηλεκτρική.`
  },
  electrical_energy: {
    term: "Ηλεκτρική ενέργεια",
    def:  `Είναι η ενέργεια που μεταφέρει το ηλεκτρικό ρεύμα η οποία αναφέρεται στην κινητική ενέργεια των κινούμενων ηλεκτρονίων (ηλεκτρικό ρεύμα).`
  },
  kinetic_energy: {
    term: "Κινητική ενέργεια K",
    def:  `Η ενέργεια που έχει ένα σώμα λόγω της κίνησής του. Όσο μεγαλύτερη η ταχύτητα (και η μάζα), τόσο μεγαλύτερη η κινητική ενέργεια.`
  },
  energy: {
    term: "Ενέργεια E",
    def:  `Ενέργεια είναι η ικανότητα ενός σώματος ή ενός συστήματος σωμάτων να παράγει έργο. Κάθε φυσικό σύστημα περιέχει ενέργεια. Σε ορισμένες περιπτώσεις μπορεί επίσης να την αποθηκεύει.`
  },
  rod_magnet: {
    term: "Ραβδόμορφος μαγνήτης",
    def:  `Ο ραβδόμορφος μαγνήτης είναι ένας μαγνήτης με σχήμα επιμήκους ράβδου, ο οποίος έχει δύο πόλους: έναν βόρειο (N) και έναν νότιο (S). Δημιουργεί ένα ομοιόμορφο μαγνητικό πεδίο, με τις μαγνητικές γραμμές να εκτείνονται από τον βόρειο προς τον νότιο πόλο, χρησιμοποιείται συχνά σε πειράματα και εφαρμογές για τη μελέτη του μαγνητισμού.`
  },
  earth: {
    term: "Γη",
    def:  `Ο πλανήτης μας, που συμπεριφέρεται σαν να έχει έναν τεράστιο «μαγνήτη» στο εσωτερικό του: λόγω κινήσεων αγώγιμων υλικών στον πυρήνα της δημιουργεί γεωμαγνητικό πεδίο, το οποίο προσανατολίζει τις μαγνητικές πυξίδες.`
  },
  compass: {
    term: "Μαγνητική πυξίδα",
    def:  `Όργανο με μαγνητισμένη βελόνα που μπορεί να περιστρέφεται ελεύθερα και προσανατολίζεται σύμφωνα με το μαγνητικό πεδίο που υπάρχει στο σημείο. Συνήθως δείχνει τη διεύθυνση του γεωμαγνητικού πεδίου (Βορράς–Νότος), αλλά κοντά σε μαγνήτη ή ηλεκτρομαγνήτη προσανατολίζεται προς το τοπικό μαγνητικό πεδίο.`
  },
magnetic_axis: {
  term: "Μαγνητικός άξονας",
  def:  `Η νοητή ευθεία που ενώνει τον μαγνητικό βόρειο και τον μαγνητικό νότιο πόλο ενός μαγνήτη. Δείχνει τη διεύθυνση κατά την οποία «είναι προσανατολισμένος» ο μαγνήτης.`
},
solar_wind: {
  term: "Ηλιακός άνεμος",
  def:  `Ροή φορτισμένων σωματιδίων (κυρίως πρωτονίων και ηλεκτρονίων) που εκπέμπει ο Ήλιος στο διάστημα. Αλληλεπιδρά με το γεωμαγνητικό πεδίο και επηρεάζει φαινόμενα όπως το σέλας.`
},
magnetization: {
  term: "Μαγνήτιση",
  def:  `Η διαδικασία με την οποία ένα σώμα αποκτά μαγνητικές ιδιότητες, όταν τα «μικροσκοπικά μαγνητάκια» του (μαγνητικές ροπές) τείνουν να προσανατολιστούν προς την ίδια κατεύθυνση.`
},
demagnetization: {
  term: "Απομαγνήτιση",
  def:  `Η μείωση ή απώλεια του μαγνητισμού ενός μαγνήτη, όταν οι μαγνητικές ροπές παύουν να έχουν κοινό προσανατολισμό (π.χ. από κρούση, θέρμανση ή ισχυρό αντίθετο πεδίο).`
},
atom: {
  term: "Άτομο",
  def:  `Το βασικό δομικό «κομμάτι» της ύλης. Αποτελείται από πυρήνα (πρωτόνια και νετρόνια) και ηλεκτρόνια που κινούνται γύρω του.`
},
electron: {
  term: "Ηλεκτρόνιο",
  def:  `Στοιχειώδες σωματίδιο με αρνητικό ηλεκτρικό φορτίο. Η κίνησή του στους αγωγούς συνδέεται με το ηλεκτρικό ρεύμα και συμβάλλει σε μαγνητικά φαινόμενα.`
},
spin: {
  term: "Σπίν",
  def:  `Μια θεμελιώδης ιδιότητα των σωματιδίων (όπως το ηλεκτρόνιο) που σχετίζεται με τη μαγνητική τους συμπεριφορά. Μπορεί να θεωρηθεί σαν «εγγενής προσανατολισμός» που δημιουργεί μαγνητική ροπή.`
},
ferromagnetic_material: {
  term: "Σιδηρομαγνητικό υλικό",
  def:  `Υλικό που μαγνητίζεται πολύ έντονα και μπορεί να παραμείνει μαγνητισμένο (π.χ. σίδηρος, νικέλιο, κοβάλτιο). Οφείλεται σε ισχυρή ευθυγράμμιση μαγνητικών ροπών σε περιοχές (domains).`
},
paramagnetic_material: {
  term: "Παραμαγνητικό υλικό",
  def:  `Υλικό που έλκεται ασθενώς από μαγνήτη. Μαγνητίζεται μόνο όσο υπάρχει εξωτερικό μαγνητικό πεδίο και μετά ο μαγνητισμός του σχεδόν χάνεται.`
},
diamagnetic_material: {
  term: "Διαμαγνητικό υλικό",
  def:  `Υλικό που απωθείται ασθενώς από μαγνήτη. Η συμπεριφορά του εμφανίζεται ως πολύ μικρή αντίθετη μαγνήτιση όταν βρεθεί σε μαγνητικό πεδίο.`
},
curie_temperature: {
  term: "Θερμοκρασία Curie",
  def:  `Η θερμοκρασία πάνω από την οποία ένα σιδηρομαγνητικό υλικό χάνει τη μόνιμη μαγνητική του συμπεριφορά και δεν παραμένει μαγνήτης (η θερμική κίνηση «ανακατεύει» τον προσανατολισμό των ροπών).`
},
electric_source: {
  term: "Ηλεκτρική πηγή",
  def:  `Συσκευή που παρέχει ενέργεια στο κύκλωμα και δημιουργεί διαφορά δυναμικού ώστε να κινηθούν τα φορτία (π.χ. μπαταρία, τροφοδοτικό, γεννήτρια).`
},
uniform_field: {
  term: "Ομογενές πεδίο",
  def:  `Πεδίο στο οποίο η ένταση και η κατεύθυνση είναι ίδιες σε όλα τα σημεία μιας περιοχής. Οι δυναμικές γραμμές είναι παράλληλες και ισαπέχουσες.`
},
nonuniform_field: {
  term: "Ανομοιογενές πεδίο",
  def:  `Πεδίο στο οποίο η ένταση και/ή η κατεύθυνση αλλάζει από σημείο σε σημείο. Οι δυναμικές γραμμές δεν είναι ισαπέχουσες και συνήθως «πυκνώνουν» εκεί όπου το πεδίο είναι ισχυρότερο.`
},
electrical_signals: {
  term: "Ηλεκτρικά σήματα",
  def:  `Μεταβολές ηλεκτρικών μεγεθών (τάση ή ρεύμα) στον χρόνο, που μεταφέρουν πληροφορία ή ενέργεια (π.χ. παλμοί, εναλλασσόμενα σήματα, ψηφιακά σήματα).`
},
michael_faraday: {
  term: "Micheal Faraday",
  def:  `Ο Michael Faraday ήταν πρωτοπόρος φυσικός που ανέδειξε την έννοια των πεδίων και ανακάλυψε την ηλεκτρομαγνητική επαγωγή: ότι μια μεταβολή μαγνητικού πεδίου μπορεί να δημιουργήσει τάση και ρεύμα σε κύκλωμα.`
},
  equator: {
    term: "Ισημερινός",
    def:  `Η νοητή γραμμή/κύκλος γύρω από τη Γη με γεωγραφικό πλάτος 0°, που χωρίζει τη Γη στο βόρειο και στο νότιο ημισφαίριο.`
  },
  atomic_nucleus: {
    term: "Ατομικός πυρήνας",
    def:  `Το κεντρικό τμήμα του ατόμου, που περιέχει πρωτόνια και νετρόνια. Έχει θετικό ηλεκτρικό φορτίο και περιλαμβάνει σχεδόν όλη τη μάζα του ατόμου.`
  },
  electron_spin: {
    term: "Σπίν ηλεκτρονίου",
    def:  `Εγγενής ιδιότητα του ηλεκτρονίου που συνδέεται με μαγνητική ροπή. Ο «προσανατολισμός» του σπίν (π.χ. πάνω/κάτω) παίζει ρόλο στη μαγνήτιση των υλικών.`
  },
  battery: {
    term: "Μπαταρία",
    def:  `Ηλεκτρική πηγή που μετατρέπει χημική ενέργεια σε ηλεκτρική και παρέχει διαφορά δυναμικού (τάση) σε ένα κύκλωμα.`
  },
  electricity: {
    term: "Ηλεκτρισμός",
    def:  `Το σύνολο φαινομένων που σχετίζονται με το ηλεκτρικό φορτίο: την ύπαρξή του, τις δυνάμεις μεταξύ φορτίων και την κίνηση των φορτίων (ηλεκτρικό ρεύμα).`
  },
  magnetism: {
    term: "Μαγνητισμός",
    def:  `Το σύνολο φαινομένων που σχετίζονται με το μαγνητικό πεδίο και τις μαγνητικές δυνάμεις, που προέρχονται από κινούμενα φορτία και από μαγνητικές ροπές στα υλικά.`
  },
  solenoid: {
    term: "Σωληνοειδές ή πηνίο",
    def:  `Αγωγός τυλιγμένος σε πολλές σπείρες γύρω από έναν άξονα. Όταν διαρρέεται από ρεύμα, δημιουργεί μαγνητικό πεδίο παρόμοιο με ραβδόμορφου μαγνήτη.`
  },
  coil_turn: {
    term: "Σπείρα πηνίου",
    def:  `Ένας πλήρης «κύκλος» (μία περιέλιξη) του σύρματος στο πηνίο. Ο αριθμός σπειρών επηρεάζει την ένταση του μαγνητικού πεδίου που δημιουργεί το πηνίο.`
  },
  coil_pitch: {
    term: "Βήμα πηνίου",
    def:  `Η απόσταση κατά μήκος του άξονα του πηνίου ανάμεσα σε δύο διαδοχικές σπείρες (ή ανάμεσα σε αντίστοιχα σημεία διαδοχικών σπειρών).`
  },
  electric_voltage: {
    term: "Ηλεκτρική τάση V",
    def:  `Η διαφορά δυναμικού ανάμεσα σε δύο σημεία ενός κυκλώματος. Εκφράζει ενέργεια ανά μονάδα φορτίου και μετριέται σε Volt (V).`
  },
  induced_electric_current: {
    term: "Επαγόμενο ηλεκτρικό ρεύμα",
    def:  `Ρεύμα που δημιουργείται σε κλειστό κύκλωμα όταν μεταβάλλεται το μαγνητικό πεδίο (ή η μαγνητική ροή) που το διαπερνά, σύμφωνα με την ηλεκτρομαγνητική επαγωγή.`
  },
  circuit_loop: {
    term: "Βρόγχος κυκλώματος",
    def:  `Κλειστή διαδρομή μέσα σε ένα ηλεκτρικό κύκλωμα. Χρησιμοποιείται, π.χ., στην εφαρμογή του κανόνα τάσεων (νόμος τάσης) του Kirchhoff.`
  },
  circuit_node: {
    term: "Κόμβος κυκλώματος",
    def:  `Σημείο σε κύκλωμα όπου ενώνονται δύο ή περισσότερα στοιχεία/αγωγοί. Όλα τα σημεία ενός ιδανικού κόμβου έχουν το ίδιο δυναμικό.`
  },
  electric_fuse: {
    term: "Ηλεκτρική ασφάλεια",
    def:  `Διάταξη προστασίας που «κόβει» το κύκλωμα όταν το ρεύμα ξεπεράσει μια ασφαλή τιμή (συνήθως με τήξη ενός λεπτού σύρματος).`
  },
  resistor: {
    term: "Αντιστάτης",
    def:  `Ηλεκτρικό στοιχείο που αντιστέκεται στη ροή του ρεύματος και μετατρέπει μέρος της ηλεκτρικής ενέργειας σε θερμότητα (φαινόμενο Joule).`
  },
  resistance_r: {
    term: "Ηλεκτρική αντίσταση R",
    def:  `Μέγεθος που δείχνει πόσο «δυσκολεύει» ένα στοιχείο τη ροή του ρεύματος. Ορίζεται ως R = V/I και μετριέται σε Ohm (Ω).`
  },
  electric_motor: {
    term: "Ηλεκτρικός κινητήρας",
    def:  `Συσκευή που μετατρέπει ηλεκτρική ενέργεια σε μηχανική, αξιοποιώντας μαγνητικές δυνάμεις (π.χ. δύναμη Laplace) πάνω σε αγωγούς με ρεύμα μέσα σε μαγνητικό πεδίο.`
  },
  electric_generator: {
    term: "Ηλεκτρική γεννήτρια",
    def:  `Συσκευή που μετατρέπει μηχανική ενέργεια σε ηλεκτρική μέσω ηλεκτρομαγνητικής επαγωγής (μεταβολή μαγνητικού πεδίου/ροής σε πηνίο).`
  },
  rotor: {
    term: "Ρότορας",
    def:  `Το περιστρεφόμενο μέρος ενός ηλεκτρικού κινητήρα ή μιας γεννήτριας (π.χ. το πηνίο ή ο μαγνήτης που γυρίζει).`
  },
  stator: {
    term: "Στάτορας",
    def:  `Το ακίνητο μέρος ενός κινητήρα ή γεννήτριας που δημιουργεί/καθοδηγεί το μαγνητικό πεδίο και «περιβάλλει» τον ρότορα.`
  },
  collector: {
    term: "Συλλέκτης",
    def:  `Στους κινητήρες συνεχούς ρεύματος είναι το τμήμα (μαζί με τις ψήκτρες) που συνδέει το περιστρεφόμενο κύκλωμα του ρότορα με το εξωτερικό κύκλωμα. Συχνά αναφέρεται ως μέρος του εναλλάκτη/commutator.`
  },
  commutator: {
    term: "Εναλλάκτης",
    def:  `Διάταξη στους κινητήρες συνεχούς ρεύματος που αλλάζει (αντιστρέφει) τη φορά του ρεύματος στο πηνίο του ρότορα κάθε μισή περιστροφή, ώστε η ροπή να διατηρείται στην ίδια φορά.`
  },
  mechanical_energy: {
    term: "Μηχανική ενέργεια Eμ",
    def:  `Η ενέργεια που σχετίζεται με την κίνηση και τη θέση ενός σώματος (συνήθως άθροισμα κινητικής και δυναμικής ενέργειας).`
  },
  electric_power: {
    term: "Ηλεκτρική ισχύς P",
    def:  `Ο ρυθμός με τον οποίο μεταφέρεται ή καταναλώνεται ηλεκτρική ενέργεια. Για πολλά κυκλώματα ισχύει P = V·I και μετριέται σε Watt (W).`
  },
  rated_voltage: {
    term: "Τάση κανονικής λειτουργίας (V)",
    def:  `Η τιμή της τάσης για την οποία έχει σχεδιαστεί μια συσκευή ώστε να λειτουργεί σωστά και με ασφάλεια, όπως αναγράφεται στα χαρακτηριστικά της.`
  },
  rated_current: {
    term: "Ρεύμα κανονικής λειτουργίας (Ι)",
    def:  `Η τιμή του ρεύματος που διαρρέει μια συσκευή όταν λειτουργεί κανονικά στις ονομαστικές συνθήκες (π.χ. στην τάση κανονικής λειτουργίας).`
  },
  joule_effect: {
    term: "Φαινόμενο Joule",
    def:  `Η παραγωγή θερμότητας όταν περνά ηλεκτρικό ρεύμα από έναν αντιστάτη/αγωγό. Η ηλεκτρική ενέργεια μετατρέπεται σε θερμική (π.χ. Q = I²·R·t).`
  },
  heat: {
    term: "Θερμότητα Q",
    def:  `Μορφή ενέργειας που μεταφέρεται λόγω διαφοράς θερμοκρασίας. Στα ηλεκτρικά κυκλώματα εμφανίζεται συχνά ως απώλεια ενέργειας λόγω του φαινομένου Joule.`
  },
  efficiency_coefficient: {
    term: "Συντελεστής απόδοσης α",
    def:  `Δείχνει πόσο αποτελεσματικά μια συσκευή μετατρέπει την εισερχόμενη ενέργεια σε ωφέλιμη. Ορίζεται ως α = (ωφέλιμη ενέργεια ή ισχύς) / (καταναλισκόμενη ενέργεια ή ισχύς) και είναι μικρότερος από 1.`
  },
  useful_energy: {
    term: "Ωφέλιμη ενέργεια",
    def:  `Η ενέργεια που παίρνουμε στην επιθυμητή μορφή από μια συσκευή (η «χρήσιμη» έξοδος).`
  },
  consumed_energy: {
    term: "Καταναλισκόμενη ενέργεια",
    def:  `Η ενέργεια που προσφέρει η πηγή σε μια συσκευή/κύκλωμα. Ισούται με ωφέλιμη ενέργεια + απώλειες (π.χ. θερμότητα).`
  },
  useful_power: {
    term: "Ωφέλιμη ισχύς",
    def:  `Η ισχύς που αποδίδεται στην επιθυμητή μορφή (χρήσιμη έξοδος ισχύος) από μια συσκευή.`
  },
  thermodynamics_laws: {
    term: "Νόμοι θερμοδυναμικής",
    def:  `Θεμελιώδεις νόμοι που περιγράφουν τη μετατροπή ενέργειας και τη ροή θερμότητας. Ο 1ος νόμος εκφράζει τη διατήρηση της ενέργειας, ενώ ο 2ος εξηγεί γιατί υπάρχουν πάντα απώλειες/μη αντιστρεπτές διεργασίες.`
  },
  wind_turbine: {
    term: "Ανεμογεννήτρια",
    def:  `Συσκευή που μετατρέπει την κινητική ενέργεια του ανέμου σε ηλεκτρική, με φτερωτή (πτερύγια) που περιστρέφει έναν άξονα και γεννήτρια.`
  },
  renewable_energy_sources: {
    term: "Ανανεώσιμες πηγές ενέργειας (ΑΠΕ)",
    def:  `Πηγές ενέργειας που ανανεώνονται φυσικά σε μικρό χρονικό διάστημα (π.χ. άνεμος, ήλιος, νερό, γεωθερμία, βιομάζα).`
  },
  wind_energy: {
    term: "Αιολική ενέργεια",
    def:  `Η ενέργεια που μεταφέρει ο κινούμενος αέρας (ο άνεμος) και μπορεί να αξιοποιηθεί από ανεμογεννήτριες για παραγωγή ηλεκτρικής ενέργειας.`
  },
  turbine_rotor: {
    term: "Φτερωτή",
    def:  `Το σύνολο των πτερυγίων/ροτόρα μιας ανεμογεννήτριας που «πιάνει» τον άνεμο και μετατρέπει την αιολική ενέργεια σε περιστροφική κίνηση.`
  },
  wind_turbine_brake: {
    term: "Φρένο ανεμογεννήτριας",
    def:  `Μηχανισμός που μειώνει ή σταματά την περιστροφή της φτερωτής για λόγους ασφάλειας (π.χ. σε πολύ δυνατό άνεμο) ή συντήρησης.`
  },
  rectifier: {
    term: "Ανορθωτής",
    def:  `Ηλεκτρονική διάταξη (συνήθως με διόδους) που μετατρέπει εναλλασσόμενο ρεύμα (AC) σε συνεχές (DC).`
  },
  wind_farm: {
    term: "Αιολικό πάρκο",
    def:  `Ομάδα ανεμογεννητριών σε μια περιοχή που λειτουργούν μαζί για παραγωγή ηλεκτρικής ενέργειας και τροφοδότηση του δικτύου.`
  },
  offshore_wind_farms: {
    term: "Παράκτια αιολικά πάρκα",
    def:  `Αιολικά πάρκα που εγκαθίστανται στη θάλασσα ή κοντά στις ακτές. Συνήθως εκμεταλλεύονται ισχυρότερους και πιο σταθερούς ανέμους, αλλά έχουν αυξημένο κόστος εγκατάστασης/συντήρησης.`
  },
  green_energy: {
    term: "Πράσινη ενέργεια",
    def:  `Ενέργεια που παράγεται με μικρή περιβαλλοντική επιβάρυνση και χαμηλές εκπομπές ρύπων/CO₂, συνήθως από ανανεώσιμες πηγές.`
  },
  lithium_battery: {
    term: "Μπαταρία λιθίου",
    def:  `Επαναφορτιζόμενη μπαταρία (Li‑ion) με μεγάλη ενεργειακή πυκνότητα. Χρησιμοποιείται ευρέως σε φορητές συσκευές και σε συστήματα αποθήκευσης ενέργειας.`
  },
  compressed_air_battery: {
    term: "Μπαταρία πεπιεσμένου αέρα",
    def:  `Τρόπος αποθήκευσης ενέργειας όπου ο αέρας συμπιέζεται και αποθηκεύεται (π.χ. σε δεξαμενές/κοιλότητες) και αργότερα εκτονώνεται για να κινήσει στρόβιλο/γεννήτρια.`
  },
  flywheel_battery: {
    term: "Μπαταρία σφονδύλου",
    def:  `Σύστημα αποθήκευσης όπου η ενέργεια αποθηκεύεται ως κινητική σε έναν σφόνδυλο που περιστρέφεται πολύ γρήγορα και ανακτάται μέσω γεννήτριας όταν χρειαστεί.`
  },
  flow_battery: {
    term: "Μπαταρία ροής",
    def:  `Επαναφορτιζόμενη μπαταρία όπου η ενέργεια αποθηκεύεται σε υγρά ηλεκτρολύτη σε εξωτερικές δεξαμενές. Η ισχύς εξαρτάται από την «στοίβα» κυψελών, ενώ η χωρητικότητα από τον όγκο των υγρών.`
  },
  lignite: {
    term: "Λιγνίτης",
    def:  `Ορυκτό καύσιμο (είδος «καφέ» άνθρακα) που χρησιμοποιείται για παραγωγή ηλεκτρικής ενέργειας. Έχει σημαντικές εκπομπές ρύπων και CO₂.`
  },
  oil: {
    term: "Πετρέλαιο",
    def:  `Ορυκτό καύσιμο (μίγμα υδρογονανθράκων) που χρησιμοποιείται κυρίως σε μεταφορές και βιομηχανία. Η καύση του παράγει ρύπους και CO₂.`
  },
  natural_gas: {
    term: "Φυσικό αέριο",
    def:  `Ορυκτό καύσιμο (κυρίως μεθάνιο) που χρησιμοποιείται για θέρμανση και παραγωγή ηλεκτρικής ενέργειας. Εκπέμπει λιγότερο CO₂ από τον άνθρακα ανά μονάδα ενέργειας, αλλά παραμένει ορυκτό καύσιμο.`
  },
  microclimate_balance: {
    term: "Μικροκλιματική ισορροπία",
    def:  `Η «ισορροπία» των συνθηκών (θερμοκρασία, υγρασία, άνεμος κ.ά.) σε μια μικρή περιοχή. Μπορεί να επηρεαστεί από το ανάγλυφο, τη βλάστηση και ανθρώπινες παρεμβάσεις.`
  },
  cetaceans: {
    term: "Κητώδη θηλαστικά",
    def:  `Θαλάσσια θηλαστικά όπως οι φάλαινες, τα δελφίνια και οι φώκαινες. Αναπνέουν αέρα με πνεύμονες και ζουν μόνιμα στο νερό.`
  }
};
